{
  "trinity_college_arts_sciences": {
    "programs": [
      {
        "major": "African & African American Studies",
        "description": "Researchers encompass anthropologists, economists, performance artists, literary critics, political scientists, philosophers, sociologists, historians, and art historians who explore music, cultural studies, film, performance, popular culture, gender, sexuality, race, public policy and law to reveal the experiences and perspectives of those of African descent."
      },
      {
        "major": "Art History",
        "description": "Part of Art, Art History & Visual Studies department with focus on international research and interdisciplinary learning. Engaged in the study of visual culture across geographic and historical categories, experienced through the perspectives of theory and practice, methodology and criticism, and digital technologies."
      },
      {
        "major": "Asian & Middle Eastern Studies",
        "description": "Explores Arabic, Chinese, Hebrew, Hindi, Japanese, and Korean culture through the lens of language and literature, social movements, nationalism and diaspora, popular culture and the media, gender, visuality and feminism, film theory, cinema and aesthetics, and the implications of religion on identity and globalization. Offers language programs in Arabic, Chinese, Hebrew, Hindi, Japanese, Korean, Persian and Sanskrit. Concentrations available in East Asia or the Middle East."
      },
      {
        "major": "Biology",
        "description": "Conducts research in ecology (including behavioral ecology, population biology, community ecology, physiological ecology, ecosystem analysis, and biogeochemistry), functional biology at the cell and molecular level, functional biology at the organismal level, and evolutionary biology. Concentrations available in anatomy, physiology & biomechanics; animal behavior; biochemistry; cell & molecular biology; ecology; evolutionary biology; genetics; genomics; marine biology; neurobiology; pharmacology; and plant biology."
      },
      {
        "major": "Biophysics",
        "description": "Interdisciplinary program combining physics and biology to understand biological systems and processes."
      },
      {
        "major": "Brazilian & Global Portuguese",
        "description": "Studies Portuguese language and explores Brazilian and Lusophone cultures, both in their countries of origin and in cultures of diaspora."
      },
      {
        "major": "Chemistry",
        "description": "Research programs focus on chemical biology, nanomaterials, energy science, theoretical/computational chemistry, and molecular and biomolecular imaging. With publications in the world's most respected journals and regular highlights in the national news media, Duke Chemistry faculty and Ph.D. students pursue cutting-edge research."
      },
      {
        "major": "Classical Languages",
        "description": "Explores the languages (ancient Greek and Latin), literatures, archaeology, art history, and histories of Greco-Roman antiquity from 3000 BCE to 900 CE, from the Nile to the North Sea, from Britain to Bactria. Research is broadly grouped in the areas of Archaeology and Visual Studies; History and Historiography; and Language and Literature."
      },
      {
        "major": "Classical Civilization",
        "description": "Explores the languages (ancient Greek and Latin), literatures, archaeology, art history, and histories of Greco-Roman antiquity from 3000 BCE to 900 CE, from the Nile to the North Sea, from Britain to Bactria. Research is broadly grouped in the areas of Archaeology and Visual Studies; History and Historiography; and Language and Literature."
      },
      {
        "major": "Computer Science",
        "description": "Top 25 department with emphasis on geometric computing; internet systems, networking & security; memory systems & massive data management; biological computing & nanotechnologies; and learning & modeling. Faculty research is highly interconnected with the disciplines of mathematics, statistics, engineering, nanotechnology, biology, biochemistry, medicine, economics, sociology, and the environmental sciences."
      },
      {
        "major": "Cultural Anthropology",
        "description": "Ranks among the top programs in the country. On the cutting edge of new debates about globalization and diaspora, popular culture and mass media, nationalism and identity, race and sexuality, and the politics of tradition and modernity. Doctoral program prepares students to meld grounded field research with theoretical sophistication."
      },
      {
        "major": "Dance",
        "description": "Internationally-recognized choreographers, scholars, teachers and performers offering the highest caliber dance training and scholarship in an atmosphere that fosters conscious embodied practice, critical thinking, and creative risk-taking. Expertise encompasses historical and contemporary African American and Afro-Caribbean dance, classical and contemporary Indian dance and dance theater, ballet and modern, post-modern and contemporary dance choreography and performance. Three study concentrations available."
      },
      {
        "major": "Earth & Climate Sciences",
        "description": "Studies the Earth's systems, climate processes, and environmental changes through interdisciplinary approaches combining geology, atmospheric science, and environmental science."
      },
      {
        "major": "Economics",
        "description": "Rapidly approaching top ten programs nationally. Broadly focused on econometrics, micro- and macro-economic theory, and applied economics, with distinctive collaborations across these boundaries. Faculty research encompasses finance, international trade, development, public sector studies, law, business and monetary economics, with specialized scholarship focused on environmental and ecological economics, cultural, agricultural and natural resource economics, education, racial inequality, and labor and economic demography."
      },
      {
        "major": "English",
        "description": "Ranked among the top ten English departments in the country. Faculty work in different historical periods and national political contexts, showing how various literatures in English make or fail to make a coherent world out of conflicts and contradictions. One of the strongest groups of its kind in the country, specialists in African American literature and culture work at the intersection of the arts, law, literature, and sexuality studies."
      },
      {
        "major": "Environmental Sciences",
        "description": "Interdisciplinary program studying environmental systems, sustainability, and ecological processes through natural science approaches."
      },
      {
        "major": "Environmental Sciences & Policy",
        "description": "Combines natural and social sciences to address environmental challenges, integrating policy analysis with scientific understanding of environmental systems."
      },
      {
        "major": "Evolutionary Anthropology",
        "description": "Focuses on understanding non-human primate and human biology in an evolutionary context. Research areas include evolutionary medicine; functional morphology; paleontology; primate behavior & ecology; primate cognition/human cognitive evolution; and systematics & comparative methods."
      },
      {
        "major": "French & Francophone Studies",
        "description": "Explores the rich traditions of French and Francophone cultures, both in France and in cultures of diaspora, including the Caribbean, Quebec, and Africa. Part of Romance Studies, a national leader for integrating the study of literature and language."
      },
      {
        "major": "Gender, Sexuality, and Feminist Studies",
        "description": "Dedicated to exploring gender identities, relations, practices, theories and institutions. Faculty scholarship encompasses historical, political, literary, philosophical, economic, representational, technological, sociological and scientific analyses. Research themes include the social impacts of the intersectionality of gender, race and class; sexuality and reproductive ethics; food politics; women's writing and feminism in contemporary art; ecofeminism, ethics and human rights."
      },
      {
        "major": "German",
        "description": "Research spans German ethics, intellectual history, theory and philosophy; literary history and criticism, including analysis of memoir, medieval and 18th through 20th century literature, Holocaust literature and German poetics; and broad cultural studies of German realism, modernism, gender, and religion and secularization. Duke is known for its innovative and highly ranked joint PhD in German Studies with UNC-Chapel Hill. Administers the Duke in Berlin global education program."
      },
      {
        "major": "Global Cultural Studies",
        "description": "Offered through the Literature department, which is a national leader in the theory, philosophy and politics of literature and media conceptualized within a global and postcolonial framework. Research spans philosophy, literature & aesthetics; film & new media; critical race theory; feminisms, gender & sexuality; globalization & post coloniality; and Marxism & critical theory."
      },
      {
        "major": "Global Health",
        "description": "One of the country's first liberal arts majors in global health and first global health co-major (must be paired with another major). First offered in 2013. Emphasizes ethically informed study of health disparities, social determinants of health, and complex relationships between health and environmental, social and cultural factors. Students have combined global health with over 40 different majors, most commonly Biology (20%), Public policy (16%), Anthropology (16%), Psychology (11%), and Other (37%). Required experiential learning activity of minimum 8 weeks full-time (320 hours) before spring semester of senior year, fulfilled through DukeEngage, Bass Connections, Student Research Training Program, or independent research. Accelerated MS-GH program available for select students. DGHI offers grants up to $5,000 for independent fieldwork projects."
      },
      {
        "major": "History",
        "description": "Among the top programs nationally. Faculty research encompasses intellectual, legal, medical and military history; politics, public life and governance; labor and working class history; gender, race and ethnicity studies; global transnational history and comparative colonial studies; religion and social movements; and an emphasis in medieval and early modern history. Regional specializations include early North America, Antebellum U.S., Modern America, Afro-America, American South, Latin America, Africa, Europe, British Empire, South Asia, Japan, China, Russia, and the French Caribbean and the Atlantic World. Thematic or geographic concentrations available."
      },
      {
        "major": "Interdepartmental Major",
        "description": "Student-originated interdepartmental major in two Trinity College departments or programs that offer a major. Students must present a written plan with signed approval from both directors of undergraduate studies to the academic dean, including a descriptive title and rationale as well as a list of courses that will be taken in both departments."
      },
      {
        "major": "International Comparative Studies",
        "description": "Helps students create coherent bachelor degree programs that emphasize the study of critical transnationalism. Students engage in interdisciplinary coursework focused on regions, engage in global education programs, and integrate the fields of culture, history, politics and language."
      },
      {
        "major": "Italian & European Studies",
        "description": "Explores Italian language, literature, culture and history. Part of Romance Studies, covering Italian cultures both in Italy and in cultures of diaspora, from Europe to the Americas."
      },
      {
        "major": "Linguistics",
        "description": "Unique inter-disciplinary program offering undergraduate classes, majors and minors, and honors thesis supervision. Particular research and teaching strengths include language and the brain (neurolinguistics), language change (historical linguistics), language and society (sociolinguistics) and language and politics. Linguistics majors develop excellent problem-solving, pattern-recognition and critical thinking skills highly valued in the job and graduate school markets."
      },
      {
        "major": "Mathematics",
        "description": "Research spans theoretical to applied mathematics. U.S. News ranks the department in the top 20 for pure mathematics and in the top 15 for applied mathematics. Faculty interests encompass algebra and combinatorics; analysis; biological modeling; computational mathematics; differential & algebraic geometry; mathematical physics; number theory; PDE & dynamical systems; physical modeling; probability; signals, images and data; and topology."
      },
      {
        "major": "Marine Science & Conservation",
        "description": "Interdisciplinary program studying marine ecosystems, ocean sciences, and conservation strategies for marine environments."
      },
      {
        "major": "Medieval & Renaissance Studies",
        "description": "Interdisciplinary program examining European culture, literature, art, history, and thought from approximately 500-1700 CE."
      },
      {
        "major": "Music",
        "description": "Faculty are a mixture of musicologists, composers, ethnomusicologists, and performers whose work embraces the many ways we perform, create and comprehend music. Specializations include American vernacular music, jazz, seventeenth-century Italian, nineteenth-century German, and twentieth-century British music, Iberian keyboard music, French musical culture, theater, film, and melodrama, South African Ngoma, and sound studies. Highly-regarded composition program attracts top aspiring composers globally. Ph.D. programs offered in composition, ethnomusicology and musicology."
      },
      {
        "major": "Neuroscience",
        "description": "Interdisciplinary program combining biology, psychology, chemistry, and other fields to study the nervous system and brain function. Part of the Psychology & Neuroscience department, internationally known for leadership in cognitive science."
      },
      {
        "major": "Philosophy",
        "description": "Strong faculty committed to excellence in research and teaching. Recognized for particular strength in philosophy of biology (rated as one of the two top programs), philosophy of mind, political philosophy, applied ethics, philosophy of social science, 17th- and 18th-Century philosophy and Chinese philosophy. Expertise also extends to ancient philosophy, Kant, 20th-Century analytic philosophy, history and philosophy of science, cognitive science, moral psychology, normative ethics, philosophy of law, metaphysics, epistemology, philosophy of language, and philosophical logic."
      },
      {
        "major": "Physics",
        "description": "Research ranges from astrophysics to condensed matter physics and nanoscale materials exploration, to non-linear and complex systems and biological physics with applications for medicine, energy and environmental science. U.S. News ranks the department in the top 6 for nuclear physics and in the top 30 for physics overall. Faculty conducts highly collaborative international research in high-energy physics; accelerator-based experimental nuclear physics; theoretical nuclear and particle physics; and experimental quantum optical physics."
      },
      {
        "major": "Political Science",
        "description": "Among the top ten programs nationally for many years. Faculty contributes to the general fields of political economy, philosophy, institutions including law, and public policy. Research encompasses normative political theory & philosophy; political behavior & identities; political economy; political institutions; political methodology; and security, peace & conflict. Affiliated with the Certificate in Philosophy, Politics & Economics and the Certificate in Decision Sciences."
      },
      {
        "major": "Program II",
        "description": "Self-designed degree program established in 1968 offering students the option to design their own individualized degree program. Serves students whose intellectual interests cross departmental boundaries or who perceive areas of learning in clusters other than those already offered in traditional majors. Students design their own curriculum to examine and explore a specific topic, question, or theme, requiring 15-18 core courses and a two-semester Senior Capstone Project. Students must have a faculty advisor (regular-rank faculty member in Arts & Sciences) and submit a written proposal including a 4-6 page personal statement, list of core courses, long-range plan (semester-by-semester course listing), justification of program title, and Senior Capstone Project plan. Application timing: between end of second semester and end of fifth semester, typically during second year. Past examples include Anthrozoology with focus on canines, Southern political experience, Health Beyond Care, and Immigration studies. Most successful proposals include courses from 4-6 different academic departments. Special features include Graduation with Distinction option, Program II Majors' Union, four information sessions per year, community lunches and retreats. Does not follow Program I requirements (no traditional major/minor structure)."
      },
      {
        "major": "Psychology",
        "description": "Internationally known for leadership in cognitive science and clinical psychology. Research in developmental psychology, social and personality psychology, cognitive psychology and cognitive neuroscience, and systems and integrative neuroscience deploys techniques such as experimental research with humans and animals, surveys, longitudinal field studies, brain imaging, genetic mapping and computational models. Scholarly exploration addresses decision-making, self-concept and self-regulation, PTSD, health and behavior, achievement and motivation, emotional memory, language acquisition and visual perception."
      },
      {
        "major": "Public Policy Studies",
        "description": "Interdisciplinary program analyzing public policy formation, implementation, and evaluation across various domains including domestic and international policy."
      },
      {
        "major": "Religious Studies",
        "description": "Very distinguished nationally. Explores the social organization and impact of religion in ancient and modern cultures through critical theory, literary and visual studies, and religious expression and influence on the media. Areas of expertise include early foundational documents of Judaism and Christianity (Hebrew Bible and New Testament); the religious traditions of Late Antiquity; Islam, Buddhism, and Hinduism both in their historical depth and in their contemporary manifestations. Graduate Program in Religion has ranked among the top programs in the country for twenty years."
      },
      {
        "major": "Romance Studies",
        "description": "National leader for having integrated the study of literature and language. Curriculum explores the rich traditions of Spanish, French, Portuguese, and Italian cultures, both in their countries of origin and in cultures of diaspora, including Latin America, the Caribbean, Quebec, and the Chicano border. Covers an extensive geographic area: from Europe to Africa and South America; from the Caribbean to the Philippines; from the Mediterranean to Indochina and the Mauritius Islands."
      },
      {
        "major": "Russian",
        "description": "Explores Russian language, literature, film, and translation. Part of Slavic & Eurasian Studies exploring the cultures and histories of Russia and Central/Eastern Europe."
      },
      {
        "major": "Slavic & Eurasian Studies",
        "description": "Explores the cultures and histories of Russia in its various historical incarnations (the tsarist empire, the Soviet Union, Russia) and Central/Eastern Europe—Bosnia, Czechia, Hungary, Poland, Romania, and Slovakia. Research interests focus on Russian language, literature, film, and translation; Polish language, literature, film, and popular culture; cognition and culture; semiotics; gender and language, literature, and film; medical humanities; death studies; imperial studies, gulag studies; Islamic studies; Jewish studies in Eastern Europe; and power and politics."
      },
      {
        "major": "Sociology",
        "description": "Ranked among the top 12 and rapidly approaching the top ten programs in the country. Faculty specializes in comparative and historical sociology; population studies across time focusing on fertility, migration, morbidity and mortality; medical and economic sociology; social stratification; and the sociology of morality and religion. Quantitative and qualitative approaches are deployed to understand the structure and dynamics of human societies in a global context."
      },
      {
        "major": "Spanish, Latin American & Latino/a Studies",
        "description": "Explores Spanish language and the rich traditions of Spanish, Latin American, and Latino/a cultures. Part of Romance Studies, covering cultures both in Spain and Latin America, and in Latino/a communities in the United States."
      },
      {
        "major": "Statistical Science",
        "description": "Top 10 program in statistical science and the premier Bayesian statistics program in the world. Helping Duke lead the data and computational revolution through research, teaching, and service. Award-winning faculty and students produce groundbreaking research in theory, methods, and applications that advances science and positively impacts society. Faculty and students collaborate with researchers in industry, government, and academia across disciplines."
      },
      {
        "major": "Theater Studies",
        "description": "Combines the study of the history and theory of theater, performance and dramatic literature in all its dimensions. The department is a laboratory for the development of new dramatic works and the exploration and integration of new media in theater. Faculty research encompasses set and lighting design; directing, playwriting, TV writing, dramatic literature, acting and puppetry; performance and film studies; literary and cultural criticism, and theater history with specialization in Chinese theater, Russian theater, and British and American theater."
      },
      {
        "major": "Visual Arts",
        "description": "Part of Art, Art History & Visual Studies department. Focus on creative practice in various media including painting, sculpture, photography, and digital arts, combined with critical analysis and art theory."
      },
      {
        "major": "Visual & Media Studies",
        "description": "Part of Art, Art History & Visual Studies department. Interdisciplinary study of visual culture, media technologies, film theory, and contemporary media practices across various platforms and contexts."
      }
    ]
  },
  "pratt_school_engineering": {
    "programs": [
      {
        "major": "Biomedical Engineering",
        "description": "Take on societally critical challenges in biology and health care, including the design of medical technology. Study areas include imaging and instrumentation, and tissue engineering. Double-major options available with Civil Engineering, Environmental Engineering, Electrical and Computer Engineering, Mechanical Engineering, and Computer Science."
      },
      {
        "major": "Civil Engineering",
        "description": "Lead the Fifth Industrial Revolution—designing solutions aimed at broadly-shared well-being, for people and the planet. Study areas include structural engineering and mechanics, and environmental engineering and water resources. Double-major option available with Biomedical Engineering."
      },
      {
        "major": "Electrical & Computer Engineering",
        "description": "Integrate computing and electronic knowledge with design skill to create new devices and software. Study areas include computer engineering and digital systems, and solid-state devices and integrated circuits."
      },
      {
        "major": "Environmental Engineering",
        "description": "Develop systems and structures that restore and protect the planet's air, water and soil. Study areas include water resources engineering, and biotechnology and bioremediation. Double-major option available with Biomedical Engineering."
      },
      {
        "major": "Mechanical Engineering",
        "description": "Invent machines that improve lives, in fields as varied as health care, manufacturing, energy and transportation. Study areas include mechatronics and mechanical design. Double-major option available with Biomedical Engineering."
      },
      {
        "major": "IDEAS (Interdisciplinary Engineering & Applied Science)",
        "description": "Self-designed engineering major where students explore ideas and topics beyond what's covered in the five departmental engineering majors. Design your own engineering major by choosing a pre-approved template or proposing your own. Students can apply as early as second semester of First Year, but not after Third Year begins, typically during Second Year. Students are responsible for identifying faculty advisor unless selecting pre-approved template. Not specifically ABET accredited, but satisfies national general engineering accreditation criteria. Requirements include 2 Independent Study, Capstone Design, or Equivalent Courses comprising a Culminating Engineering Design Experience; five courses with at least one code of CE, HI, IJ, SB, or LG that must cumulatively cover at least 4 of 5 codes; Liberal Arts requirement courses must be taken post-matriculation on graded basis. Approved templates include Risk, Data, and Financial Engineering (focus on risk and resilience engineering, data science, and machine learning with culminating engineering design experience) and General Curriculum template for creating unique curriculum. Students can use pre-approved curricula templates or propose their own unique combinations in consultation with independent study advisor and faculty members."
      }
    ]
  }
}